<?php
return [
    'url_route_on'=>  true,
//    'url_route_must'=>  true,
//    'url_domain_deploy' =>  true,
//    'url_domain_deploy' =>  true,
//    'url_domain_root'    =>  'tp.jh',
    'default_return_type'=>'json',
    
    'code'=>[
        
        '0'=>'操作成功',
        '100'=>'操作失败，客户端异常',
        //检查数据
        '1101'=>'缺少手机号码',
        '1102'=>'手机号码不符合规则',
        '1103'=>'缺少验证码',
        '1104'=>'验证码不符合规则，只含有4位数字',
        '1105'=>'缺少用户Id',
        '1106'=>'缺少用户密码',
        '1107'=>'用户密码不符合规则，超出限制范围',
        //用户相关
        '1201'=>'短信验证码初始化失败',
        '1202'=>'短信验证码达到今日发送上线',
        '1203'=>'短信验证码发送失败',
        '1204'=>'短信验证码发送成功',
        '1205'=>'该用户还没有发送短信',
        '1206'=>'短信验证码状态更新失败',
        '1207'=>'短信验证码匹配不成功',
        '1208'=>'短信验证成功',
        '1209'=>'修改密码失败，请重试:',
        '1230'=>'修改密码成功',
        '1231'=>'数据库插入用户数据失败',
        '1240'=>'添加用户成功',
        '1241'=>'用户已经存在',
        '1242'=>'用户资料获取失败',
        '1243'=>'用户资料获取成功',
        '1244'=>'图片上传失败',
        '1245'=>'修改用户头像失败',
        '1246'=>'修改用户头像成功',
        
        
        
        '200'=>'操作失败，服务器异常',
        
    ]
    
];
